#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
    基础理论:
        起源：河图洛书
        基础：五行、干支、阴阳、八卦
        占星：星宿
        万年历：计算年月日时的干支
"""

# 字典
HE_TU = ((2, 7),
         (3, 8), (5, 10), (4, 9),
         (1, 6))  # 河图：五行之源，五宫，每宫两个数
LUO_SHU = ((4, 9, 2),
           (3, 5, 7),
           (8, 1, 6))  # 洛书：先天八卦之源，九宫，紫微、奇门等使用
LIANG_YI = {'阳': {'shape': 0b1, 'value': 0},
            '阴': {'shape': 0b0, 'value': 1}}  # 两仪：
SI_XIANG = {'太阳': {'shape': 0b11, 'value': 1},
            '少阴': {'shape': 0b10, 'value': 2},
            '少阳': {'shape': 0b01, 'value': 3},
            '太阴': {'shape': 0b00, 'value': 4}}  # 四象：
BA_GUA = {'乾': {'shape': 0b111, 'value': 9, '卦象': '天'},
          '震': {'shape': 0b100, 'value': 8, '卦象': '雷'},
          '坎': {'shape': 0b010, 'value': 7, '卦象': '水'},
          '艮': {'shape': 0b001, 'value': 6, '卦象': '山'},
          '兑': {'shape': 0b110, 'value': 4, '卦象': '泽'},
          '离': {'shape': 0b101, 'value': 3, '卦象': '火'},
          '巽': {'shape': 0b011, 'value': 2, '卦象': '风'},
          '坤': {'shape': 0b000, 'value': 1, '卦象': '地'}}  # 八卦：先天
WU_XING = {'水': {'value': 1, '方位': '北', '季节': '冬', '五脏': '肾', '五腑': '膀胱', '五官': '耳', '五体': '骨', '五色': '黑', '五味': '咸', '五情': '恐', '五兽': '玄武'},
           '火': {'value': 2, '方位': '南', '季节': '夏', '五脏': '心', '五腑': '小肠', '五官': '舌', '五体': '脉', '五色': '赤', '五味': '苦', '五情': '怒', '五兽': '朱雀'},
           '木': {'value': 3, '方位': '东', '季节': '春', '五脏': '肝', '五腑': '胆', '五官': '眼', '五体': '筋', '五色': '青', '五味': '酸', '五情': '喜', '五兽': '青龙'},
           '金': {'value': 4, '方位': '西', '季节': '秋', '五脏': '肺', '五腑': '大肠', '五官': '鼻', '五体': '皮毛', '五色': '白', '五味': '辛', '五情': '悲', '五兽': '白虎'},
           '土': {'value': 5, '方位': '中', '季节': '夏末', '五脏': '脾', '五腑': '胃', '五官': '口', '五体': '肉', '五色': '黄', '五味': '甘', '五情': '思', '五兽': '麒麟'}}  # 五行：按相生顺序
TIAN_GAN = {'甲': {'阴阳': '阳', '五行': '木'},
            '乙': {'阴阳': '阴', '五行': '木'},
            '丙': {'阴阳': '阳', '五行': '火'},
            '丁': {'阴阳': '阴', '五行': '火'},
            '戊': {'阴阳': '阳', '五行': '土'},
            '己': {'阴阳': '阴', '五行': '土'},
            '庚': {'阴阳': '阳', '五行': '金'},
            '辛': {'阴阳': '阴', '五行': '金'},
            '壬': {'阴阳': '阳', '五行': '水'},
            '癸': {'阴阳': '阴', '五行': '水'}}  # 天干：
DI_ZHI = {'子': {'阴阳': '阳', '五行': '水', '生肖': '鼠', '月份': '11', '时辰': '23-1'},
          '丑': {'阴阳': '阴', '五行': '土', '生肖': '牛', '月份': '12', '时辰': '1-3'},
          '寅': {'阴阳': '阳', '五行': '木', '生肖': '虎', '月份': '1', '时辰': '3-5'},
          '卯': {'阴阳': '阴', '五行': '木', '生肖': '兔', '月份': '2', '时辰': '5-7'},
          '辰': {'阴阳': '阳', '五行': '土', '生肖': '龙', '月份': '3', '时辰': '7-9'},
          '巳': {'阴阳': '阴', '五行': '火', '生肖': '蛇', '月份': '4', '时辰': '9-11'},
          '午': {'阴阳': '阳', '五行': '火', '生肖': '马', '月份': '5', '时辰': '11-13'},
          '未': {'阴阳': '阴', '五行': '土', '生肖': '羊', '月份': '6', '时辰': '13-15'},
          '申': {'阴阳': '阳', '五行': '金', '生肖': '猴', '月份': '7', '时辰': '15-17'},
          '酉': {'阴阳': '阴', '五行': '金', '生肖': '鸡', '月份': '8', '时辰': '17-19'},
          '戌': {'阴阳': '阳', '五行': '土', '生肖': '狗', '月份': '9', '时辰': '19-21'},
          '亥': {'阴阳': '阴', '五行': '水', '生肖': '猪', '月份': '10', '时辰': '21-23'}}  # 地支：
JIE_QI = {'立春': {'start-time': '', 'type': '节'},
          '雨水': {'start-time': '', 'type': '气'},
          '惊蛰': {'start-time': '', 'type': '节'},
          '春分': {'start-time': '', 'type': '气'},
          '清明': {'start-time': '', 'type': '节'},
          '谷雨': {'start-time': '', 'type': '气'},
          '立夏': {'start-time': '', 'type': '节'},
          '小满': {'start-time': '', 'type': '气'},
          '芒种': {'start-time': '', 'type': '节'},
          '夏至': {'start-time': '', 'type': '气'},
          '小暑': {'start-time': '', 'type': '节'},
          '大暑': {'start-time': '', 'type': '气'},
          '立秋': {'start-time': '', 'type': '节'},
          '处暑': {'start-time': '', 'type': '气'},
          '白露': {'start-time': '', 'type': '节'},
          '秋分': {'start-time': '', 'type': '气'},
          '寒露': {'start-time': '', 'type': '节'},
          '霜降': {'start-time': '', 'type': '气'},
          '立冬': {'start-time': '', 'type': '节'},
          '小雪': {'start-time': '', 'type': '气'},
          '大雪': {'start-time': '', 'type': '节'},
          '冬至': {'start-time': '', 'type': '气'},
          '小寒': {'start-time': '', 'type': '节'},
          '大寒': {'start-time': '', 'type': '气'}}  # 节气：
XING_XIU = {'角': {'方位': '东', '七星': '木', '星兽': '蛟'},
            '亢': {'方位': '东', '七星': '金', '星兽': '龙'},
            '氐': {'方位': '东', '七星': '土', '星兽': '貉'},
            '房': {'方位': '东', '七星': '日', '星兽': '兔'},
            '心': {'方位': '东', '七星': '月', '星兽': '狐'},
            '尾': {'方位': '东', '七星': '火', '星兽': '虎'},
            '箕': {'方位': '东', '七星': '水', '星兽': '豹'},
            '井': {'方位': '南', '七星': '木', '星兽': '犴'},
            '鬼': {'方位': '南', '七星': '金', '星兽': '羊'},
            '柳': {'方位': '南', '七星': '土', '星兽': '獐'},
            '星': {'方位': '南', '七星': '日', '星兽': '马'},
            '张': {'方位': '南', '七星': '月', '星兽': '鹿'},
            '翼': {'方位': '南', '七星': '火', '星兽': '蛇'},
            '轸': {'方位': '南', '七星': '水', '星兽': '蚓'},
            '奎': {'方位': '西', '七星': '木', '星兽': '狼'},
            '娄': {'方位': '西', '七星': '金', '星兽': '狗'},
            '胃': {'方位': '西', '七星': '土', '星兽': '雉'},
            '昴': {'方位': '西', '七星': '日', '星兽': '鸡'},
            '毕': {'方位': '西', '七星': '月', '星兽': '乌'},
            '觜': {'方位': '西', '七星': '火', '星兽': '猴'},
            '参': {'方位': '西', '七星': '水', '星兽': '猿'},
            '斗': {'方位': '北', '七星': '木', '星兽': '獬'},
            '牛': {'方位': '北', '七星': '金', '星兽': '牛'},
            '女': {'方位': '北', '七星': '土', '星兽': '蝠'},
            '虚': {'方位': '北', '七星': '日', '星兽': '鼠'},
            '危': {'方位': '北', '七星': '月', '星兽': '燕'},
            '室': {'方位': '北', '七星': '火', '星兽': '猪'},
            '壁': {'方位': '北', '七星': '水', '星兽': '貐'}}  # 星宿：

# 衍生
JIA_ZI = {}  # 60甲子
GUA_YAO = {}  # 64卦

# 万年历
