#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
    紫微斗数:
        By Yanxingfei(1139),2016.08.10
"""

import src.base

# 字典
GONG_WEI = {}
XING_YAO = {'正曜':
                {'紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {}},
            '辅曜':
                {'紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {},
                 '紫微': {}},
            '化曜':
                {'化禄': {},
                 '化权': {},
                 '化科': {},
                 '化忌': {}},
            '杂曜': {}}
